Ran Plan for dir: `test/group/s3` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.s3_bucket.aws_s3_bucket.this[0] has changed
~ resource "aws_s3_bucket" "this" {
        id                          = "leigholiver-atlantis-202204221938-renamed"
      + tags                        = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.this[0] must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::leigholiver-atlantis-202204221938-renamed" -> (known after apply)
      ~ bucket                      = "leigholiver-atlantis-202204221938-renamed" -> "leigholiver-atlantis-202204221938-edited" # forces replacement
      ~ bucket_domain_name          = "leigholiver-atlantis-202204221938-renamed.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "leigholiver-atlantis-202204221938-renamed.s3.eu-west-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1BKCTXD74EZPE" -> (known after apply)
      ~ id                          = "leigholiver-atlantis-202204221938-renamed" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ region                      = "eu-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

  # module.s3_bucket.aws_s3_bucket_acl.this[0] must be replaced
-/+ resource "aws_s3_bucket_acl" "this" {
      ~ bucket = "leigholiver-atlantis-202204221938-renamed" -> (known after apply) # forces replacement
      ~ id     = "leigholiver-atlantis-202204221938-renamed,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "leighdoliver" -> null
                  - id           = "0aa9b9cd65c331240aa87b13d42e5fd235b3e2a5824280860fe8592211b77dff" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          ~ owner {
              ~ display_name = "leighdoliver" -> (known after apply)
              ~ id           = "0aa9b9cd65c331240aa87b13d42e5fd235b3e2a5824280860fe8592211b77dff" -> (known after apply)
            }
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "leigholiver-atlantis-202204221938-renamed" -> (known after apply) # forces replacement
      ~ id                      = "leigholiver-atlantis-202204221938-renamed" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d test/group/s3`
* :put_litter_in_its_place: To **delete** this plan click [here](http://7e960a802aea:4141/lock?id=leigholiver%252Fatlantis-testing%252Ftest%252Fgroup%252Fs3%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d test/group/s3`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
